Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UOTGIRSET : (USBCORE Offset: 0x48) (R/W 32)  -------- */
#define USBCORE_UOTGIRSET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIRSET)   Reset Value */

#define USBCORE_UOTGIRSET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIRSET) Register Mask  */


/* -------- USBCORE_UOTGIRINV : (USBCORE Offset: 0x4C) (R/W 32)  -------- */
#define USBCORE_UOTGIRINV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIRINV)   Reset Value */

#define USBCORE_UOTGIRINV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIRINV) Register Mask  */


/* -------- USBCORE_UOTGIE : (USBCORE Offset: 0x50) (R/W 32) USB OTG Interrupt Enable Register -------- */
#define USBCORE_UOTGIE_AVBUS_VLD_Pos          _UINT32_(0)                                          /* (USBCORE_UOTGIE) A- Vbus Valid Interrupt Enable bit Position */
#define USBCORE_UOTGIE_AVBUS_VLD_Msk          (_UINT32_(0x1) << USBCORE_UOTGIE_AVBUS_VLD_Pos)      /* (USBCORE_UOTGIE) A- Vbus Valid Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_AVBUS_VLD(value)       (USBCORE_UOTGIE_AVBUS_VLD_Msk & (_UINT32_(value) << USBCORE_UOTGIE_AVBUS_VLD_Pos)) /* Assigment of value for AVBUS_VLD in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_AVBUS_VLD_ON_Val     _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) A-Vbus valid interrupt is enabled  */
#define   USBCORE_UOTGIE_AVBUS_VLD_OFF_Val    _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) A-Vbus valid interrupt is disabled  */
#define USBCORE_UOTGIE_AVBUS_VLD_ON           (USBCORE_UOTGIE_AVBUS_VLD_ON_Val << USBCORE_UOTGIE_AVBUS_VLD_Pos) /* (USBCORE_UOTGIE) A-Vbus valid interrupt is enabled Position  */
#define USBCORE_UOTGIE_AVBUS_VLD_OFF          (USBCORE_UOTGIE_AVBUS_VLD_OFF_Val << USBCORE_UOTGIE_AVBUS_VLD_Pos) /* (USBCORE_UOTGIE) A-Vbus valid interrupt is disabled Position  */
#define USBCORE_UOTGIE_BSESS_END_Pos          _UINT32_(2)                                          /* (USBCORE_UOTGIE) B-Session End Interrupt Enable bit Position */
#define USBCORE_UOTGIE_BSESS_END_Msk          (_UINT32_(0x1) << USBCORE_UOTGIE_BSESS_END_Pos)      /* (USBCORE_UOTGIE) B-Session End Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_BSESS_END(value)       (USBCORE_UOTGIE_BSESS_END_Msk & (_UINT32_(value) << USBCORE_UOTGIE_BSESS_END_Pos)) /* Assigment of value for BSESS_END in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_BSESS_END_ON_Val     _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) B-session end interrupt is enabled  */
#define   USBCORE_UOTGIE_BSESS_END_OFF_Val    _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) B-session end interrupt is disabled  */
#define USBCORE_UOTGIE_BSESS_END_ON           (USBCORE_UOTGIE_BSESS_END_ON_Val << USBCORE_UOTGIE_BSESS_END_Pos) /* (USBCORE_UOTGIE) B-session end interrupt is enabled Position  */
#define USBCORE_UOTGIE_BSESS_END_OFF          (USBCORE_UOTGIE_BSESS_END_OFF_Val << USBCORE_UOTGIE_BSESS_END_Pos) /* (USBCORE_UOTGIE) B-session end interrupt is disabled Position  */
#define USBCORE_UOTGIE_SESS_VLD_Pos           _UINT32_(3)                                          /* (USBCORE_UOTGIE) Session Valid Interrupt Enable bit Position */
#define USBCORE_UOTGIE_SESS_VLD_Msk           (_UINT32_(0x1) << USBCORE_UOTGIE_SESS_VLD_Pos)       /* (USBCORE_UOTGIE) Session Valid Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_SESS_VLD(value)        (USBCORE_UOTGIE_SESS_VLD_Msk & (_UINT32_(value) << USBCORE_UOTGIE_SESS_VLD_Pos)) /* Assigment of value for SESS_VLD in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_SESS_VLD_ON_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) Session valid interrupt is enabled  */
#define   USBCORE_UOTGIE_SESS_VLD_OFF_Val     _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) Session valid interrupt is disabled  */
#define USBCORE_UOTGIE_SESS_VLD_ON            (USBCORE_UOTGIE_SESS_VLD_ON_Val << USBCORE_UOTGIE_SESS_VLD_Pos) /* (USBCORE_UOTGIE) Session valid interrupt is enabled Position  */
#define USBCORE_UOTGIE_SESS_VLD_OFF           (USBCORE_UOTGIE_SESS_VLD_OFF_Val << USBCORE_UOTGIE_SESS_VLD_Pos) /* (USBCORE_UOTGIE) Session valid interrupt is disabled Position  */
#define USBCORE_UOTGIE_ACTIVITY_Pos           _UINT32_(4)                                          /* (USBCORE_UOTGIE) Activity Interrupt Enable bit Position */
#define USBCORE_UOTGIE_ACTIVITY_Msk           (_UINT32_(0x1) << USBCORE_UOTGIE_ACTIVITY_Pos)       /* (USBCORE_UOTGIE) Activity Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_ACTIVITY(value)        (USBCORE_UOTGIE_ACTIVITY_Msk & (_UINT32_(value) << USBCORE_UOTGIE_ACTIVITY_Pos)) /* Assigment of value for ACTIVITY in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_ACTIVITY_ON_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) ACTIVITY interrupt is enabled  */
#define   USBCORE_UOTGIE_ACTIVITY_OFF_Val     _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) ACTIVITY interrupt is disabled  */
#define USBCORE_UOTGIE_ACTIVITY_ON            (USBCORE_UOTGIE_ACTIVITY_ON_Val << USBCORE_UOTGIE_ACTIVITY_Pos) /* (USBCORE_UOTGIE) ACTIVITY interrupt is enabled Position  */
#define USBCORE_UOTGIE_ACTIVITY_OFF           (USBCORE_UOTGIE_ACTIVITY_OFF_Val << USBCORE_UOTGIE_ACTIVITY_Pos) /* (USBCORE_UOTGIE) ACTIVITY interrupt is disabled Position  */
#define USBCORE_UOTGIE_LSTATE_Pos             _UINT32_(5)                                          /* (USBCORE_UOTGIE) Line State Interrupt Enable bit Position */
#define USBCORE_UOTGIE_LSTATE_Msk             (_UINT32_(0x1) << USBCORE_UOTGIE_LSTATE_Pos)         /* (USBCORE_UOTGIE) Line State Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_LSTATE(value)          (USBCORE_UOTGIE_LSTATE_Msk & (_UINT32_(value) << USBCORE_UOTGIE_LSTATE_Pos)) /* Assigment of value for LSTATE in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_LSTATE_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) Line state interrupt is enabled  */
#define   USBCORE_UOTGIE_LSTATE_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) Line state interrupt is disabled  */
#define USBCORE_UOTGIE_LSTATE_ON              (USBCORE_UOTGIE_LSTATE_ON_Val << USBCORE_UOTGIE_LSTATE_Pos) /* (USBCORE_UOTGIE) Line state interrupt is enabled Position  */
#define USBCORE_UOTGIE_LSTATE_OFF             (USBCORE_UOTGIE_LSTATE_OFF_Val << USBCORE_UOTGIE_LSTATE_Pos) /* (USBCORE_UOTGIE) Line state interrupt is disabled Position  */
#define USBCORE_UOTGIE_ONE_MSEC_Pos           _UINT32_(6)                                          /* (USBCORE_UOTGIE) 1 Millisecond Timer Interrupt Enable bit Position */
#define USBCORE_UOTGIE_ONE_MSEC_Msk           (_UINT32_(0x1) << USBCORE_UOTGIE_ONE_MSEC_Pos)       /* (USBCORE_UOTGIE) 1 Millisecond Timer Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_ONE_MSEC(value)        (USBCORE_UOTGIE_ONE_MSEC_Msk & (_UINT32_(value) << USBCORE_UOTGIE_ONE_MSEC_Pos)) /* Assigment of value for ONE_MSEC in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_ONE_MSEC_ON_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) 1 millisecond timer interrupt is enabled  */
#define   USBCORE_UOTGIE_ONE_MSEC_OFF_Val     _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) 1 millisecond timer interrupt is disabled  */
#define USBCORE_UOTGIE_ONE_MSEC_ON            (USBCORE_UOTGIE_ONE_MSEC_ON_Val << USBCORE_UOTGIE_ONE_MSEC_Pos) /* (USBCORE_UOTGIE) 1 millisecond timer interrupt is enabled Position  */
#define USBCORE_UOTGIE_ONE_MSEC_OFF           (USBCORE_UOTGIE_ONE_MSEC_OFF_Val << USBCORE_UOTGIE_ONE_MSEC_Pos) /* (USBCORE_UOTGIE) 1 millisecond timer interrupt is disabled Position  */
#define USBCORE_UOTGIE_IDIE_Pos               _UINT32_(7)                                          /* (USBCORE_UOTGIE) ID Interrupt Enable bit Position */
#define USBCORE_UOTGIE_IDIE_Msk               (_UINT32_(0x1) << USBCORE_UOTGIE_IDIE_Pos)           /* (USBCORE_UOTGIE) ID Interrupt Enable bit Mask */
#define USBCORE_UOTGIE_IDIE(value)            (USBCORE_UOTGIE_IDIE_Msk & (_UINT32_(value) << USBCORE_UOTGIE_IDIE_Pos)) /* Assigment of value for IDIE in the USBCORE_UOTGIE register */
#define   USBCORE_UOTGIE_IDIE_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UOTGIE) ID interrupt is enabled  */
#define   USBCORE_UOTGIE_IDIE_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UOTGIE) ID interrupt is disabled  */
#define USBCORE_UOTGIE_IDIE_ON                (USBCORE_UOTGIE_IDIE_ON_Val << USBCORE_UOTGIE_IDIE_Pos) /* (USBCORE_UOTGIE) ID interrupt is enabled Position  */
#define USBCORE_UOTGIE_IDIE_OFF               (USBCORE_UOTGIE_IDIE_OFF_Val << USBCORE_UOTGIE_IDIE_Pos) /* (USBCORE_UOTGIE) ID interrupt is disabled Position  */
#define USBCORE_UOTGIE_Msk                    _UINT32_(0x000000FD)                                 /* (USBCORE_UOTGIE) Register Mask  */


/* -------- USBCORE_UOTGIECLR : (USBCORE Offset: 0x54) (R/W 32)  -------- */
#define USBCORE_UOTGIECLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIECLR)   Reset Value */

#define USBCORE_UOTGIECLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIECLR) Register Mask  */


/* -------- USBCORE_UOTGIESET : (USBCORE Offset: 0x58) (R/W 32)  -------- */
#define USBCORE_UOTGIESET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIESET)   Reset Value */

#define USBCORE_UOTGIESET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIESET) Register Mask  */


/* -------- USBCORE_UOTGIEINV : (USBCORE Offset: 0x5C) (R/W 32)  -------- */
#define USBCORE_UOTGIEINV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIEINV)   Reset Value */

#define USBCORE_UOTGIEINV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIEINV) Register Mask  */


/* -------- USBCORE_UOTGSTAT : (USBCORE Offset: 0x60) (R/W 32) USB OTG Status Register -------- */
#define USBCORE_UOTGSTAT_VBUSVD_Pos           _UINT32_(0)                                          /* (USBCORE_UOTGSTAT) A-VBUS Valid Indicator bit Position */
#define USBCORE_UOTGSTAT_VBUSVD_Msk           (_UINT32_(0x1) << USBCORE_UOTGSTAT_VBUSVD_Pos)       /* (USBCORE_UOTGSTAT) A-VBUS Valid Indicator bit Mask */
#define USBCORE_UOTGSTAT_VBUSVD(value)        (USBCORE_UOTGSTAT_VBUSVD_Msk & (_UINT32_(value) << USBCORE_UOTGSTAT_VBUSVD_Pos)) /* Assigment of value for VBUSVD in the USBCORE_UOTGSTAT register */
#define   USBCORE_UOTGSTAT_VBUSVD_ABOVE_Val   _UINT32_(0x1)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is above VA_VBUS_VLD on the A device  */
#define   USBCORE_UOTGSTAT_VBUSVD_BELOW_Val   _UINT32_(0x0)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is below VA_VBUS_VLD on the A device  */
#define USBCORE_UOTGSTAT_VBUSVD_ABOVE         (USBCORE_UOTGSTAT_VBUSVD_ABOVE_Val << USBCORE_UOTGSTAT_VBUSVD_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is above VA_VBUS_VLD on the A device Position  */
#define USBCORE_UOTGSTAT_VBUSVD_BELOW         (USBCORE_UOTGSTAT_VBUSVD_BELOW_Val << USBCORE_UOTGSTAT_VBUSVD_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is below VA_VBUS_VLD on the A device Position  */
#define USBCORE_UOTGSTAT_SESEND_Pos           _UINT32_(2)                                          /* (USBCORE_UOTGSTAT) B-Session End Indicator bit Position */
#define USBCORE_UOTGSTAT_SESEND_Msk           (_UINT32_(0x1) << USBCORE_UOTGSTAT_SESEND_Pos)       /* (USBCORE_UOTGSTAT) B-Session End Indicator bit Mask */
#define USBCORE_UOTGSTAT_SESEND(value)        (USBCORE_UOTGSTAT_SESEND_Msk & (_UINT32_(value) << USBCORE_UOTGSTAT_SESEND_Pos)) /* Assigment of value for SESEND in the USBCORE_UOTGSTAT register */
#define   USBCORE_UOTGSTAT_SESEND_BELOW_Val   _UINT32_(0x1)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is below VB_SESS_END on the B device  */
#define   USBCORE_UOTGSTAT_SESEND_ABOVE_Val   _UINT32_(0x0)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is above VB_SESS_END on the B device  */
#define USBCORE_UOTGSTAT_SESEND_BELOW         (USBCORE_UOTGSTAT_SESEND_BELOW_Val << USBCORE_UOTGSTAT_SESEND_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is below VB_SESS_END on the B device Position  */
#define USBCORE_UOTGSTAT_SESEND_ABOVE         (USBCORE_UOTGSTAT_SESEND_ABOVE_Val << USBCORE_UOTGSTAT_SESEND_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is above VB_SESS_END on the B device Position  */
#define USBCORE_UOTGSTAT_SESVD_Pos            _UINT32_(3)                                          /* (USBCORE_UOTGSTAT) Session Valid Indicator bit Position */
#define USBCORE_UOTGSTAT_SESVD_Msk            (_UINT32_(0x1) << USBCORE_UOTGSTAT_SESVD_Pos)        /* (USBCORE_UOTGSTAT) Session Valid Indicator bit Mask */
#define USBCORE_UOTGSTAT_SESVD(value)         (USBCORE_UOTGSTAT_SESVD_Msk & (_UINT32_(value) << USBCORE_UOTGSTAT_SESVD_Pos)) /* Assigment of value for SESVD in the USBCORE_UOTGSTAT register */
#define   USBCORE_UOTGSTAT_SESVD_ABOVE_Val    _UINT32_(0x1)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is above Session Valid on the A or B device  */
#define   USBCORE_UOTGSTAT_SESVD_BELOW_Val    _UINT32_(0x0)                                        /* (USBCORE_UOTGSTAT) Vbus voltage is below Session Valid on the A or B device  */
#define USBCORE_UOTGSTAT_SESVD_ABOVE          (USBCORE_UOTGSTAT_SESVD_ABOVE_Val << USBCORE_UOTGSTAT_SESVD_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is above Session Valid on the A or B device Position  */
#define USBCORE_UOTGSTAT_SESVD_BELOW          (USBCORE_UOTGSTAT_SESVD_BELOW_Val << USBCORE_UOTGSTAT_SESVD_Pos) /* (USBCORE_UOTGSTAT) Vbus voltage is below Session Valid on the A or B device Position  */
#define USBCORE_UOTGSTAT_LSTATE_Pos           _UINT32_(5)                                          /* (USBCORE_UOTGSTAT) Line State Stable Indicator bit Position */
#define USBCORE_UOTGSTAT_LSTATE_Msk           (_UINT32_(0x1) << USBCORE_UOTGSTAT_LSTATE_Pos)       /* (USBCORE_UOTGSTAT) Line State Stable Indicator bit Mask */
#define USBCORE_UOTGSTAT_LSTATE(value)        (USBCORE_UOTGSTAT_LSTATE_Msk & (_UINT32_(value) << USBCORE_UOTGSTAT_LSTATE_Pos)) /* Assigment of value for LSTATE in the USBCORE_UOTGSTAT register */
#define   USBCORE_UOTGSTAT_LSTATE_STABLE_Val  _UINT32_(0x1)                                        /* (USBCORE_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has been stable for the previous 1 ms  */
#define   USBCORE_UOTGSTAT_LSTATE_NOT_STABLE_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has not been stable for the previous 1 ms  */
#define USBCORE_UOTGSTAT_LSTATE_STABLE        (USBCORE_UOTGSTAT_LSTATE_STABLE_Val << USBCORE_UOTGSTAT_LSTATE_Pos) /* (USBCORE_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has been stable for the previous 1 ms Position  */
#define USBCORE_UOTGSTAT_LSTATE_NOT_STABLE    (USBCORE_UOTGSTAT_LSTATE_NOT_STABLE_Val << USBCORE_UOTGSTAT_LSTATE_Pos) /* (USBCORE_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has not been stable for the previous 1 ms Position  */
#define USBCORE_UOTGSTAT_ID_Pos               _UINT32_(7)                                          /* (USBCORE_UOTGSTAT) ID Pin State Indicator bit Position */
#define USBCORE_UOTGSTAT_ID_Msk               (_UINT32_(0x1) << USBCORE_UOTGSTAT_ID_Pos)           /* (USBCORE_UOTGSTAT) ID Pin State Indicator bit Mask */
#define USBCORE_UOTGSTAT_ID(value)            (USBCORE_UOTGSTAT_ID_Msk & (_UINT32_(value) << USBCORE_UOTGSTAT_ID_Pos)) /* Assigment of value for ID in the USBCORE_UOTGSTAT register */
#define   USBCORE_UOTGSTAT_ID_NOT_PLUG_Val    _UINT32_(0x1)                                        /* (USBCORE_UOTGSTAT) No cable is attached or a Type-B cable has been plugged into the USB receptacle  */
#define   USBCORE_UOTGSTAT_ID_PLUG_Val        _UINT32_(0x0)                                        /* (USBCORE_UOTGSTAT) A Type-A cable has been plugged into the USB receptacle  */
#define USBCORE_UOTGSTAT_ID_NOT_PLUG          (USBCORE_UOTGSTAT_ID_NOT_PLUG_Val << USBCORE_UOTGSTAT_ID_Pos) /* (USBCORE_UOTGSTAT) No cable is attached or a Type-B cable has been plugged into the USB receptacle Position  */
#define USBCORE_UOTGSTAT_ID_PLUG              (USBCORE_UOTGSTAT_ID_PLUG_Val << USBCORE_UOTGSTAT_ID_Pos) /* (USBCORE_UOTGSTAT) A Type-A cable has been plugged into the USB receptacle Position  */
#define USBCORE_UOTGSTAT_Msk                  _UINT32_(0x000000AD)                                 /* (USBCORE_UOTGSTAT) Register Mask  */


