Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UFRMLCLR : (USBCORE Offset: 0x284) (R/W 32)  -------- */
#define USBCORE_UFRMLCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMLCLR)   Reset Value */

#define USBCORE_UFRMLCLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMLCLR) Register Mask  */


/* -------- USBCORE_UFRMLSET : (USBCORE Offset: 0x288) (R/W 32)  -------- */
#define USBCORE_UFRMLSET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMLSET)   Reset Value */

#define USBCORE_UFRMLSET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMLSET) Register Mask  */


/* -------- USBCORE_UFRMLINV : (USBCORE Offset: 0x28C) (R/W 32)  -------- */
#define USBCORE_UFRMLINV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMLINV)   Reset Value */

#define USBCORE_UFRMLINV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMLINV) Register Mask  */


/* -------- USBCORE_UFRMH : (USBCORE Offset: 0x290) ( R/ 32) USB Frame Number High Register -------- */
#define USBCORE_UFRMH_FRMH_Pos                _UINT32_(0)                                          /* (USBCORE_UFRMH)  Position */
#define USBCORE_UFRMH_FRMH_Msk                (_UINT32_(0x7) << USBCORE_UFRMH_FRMH_Pos)            /* (USBCORE_UFRMH)  Mask */
#define USBCORE_UFRMH_FRMH(value)             (USBCORE_UFRMH_FRMH_Msk & (_UINT32_(value) << USBCORE_UFRMH_FRMH_Pos)) /* Assigment of value for FRMH in the USBCORE_UFRMH register */
#define USBCORE_UFRMH_Msk                     _UINT32_(0x00000007)                                 /* (USBCORE_UFRMH) Register Mask  */


/* -------- USBCORE_UFRMHCLR : (USBCORE Offset: 0x294) (R/W 32)  -------- */
#define USBCORE_UFRMHCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMHCLR)   Reset Value */

#define USBCORE_UFRMHCLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMHCLR) Register Mask  */


/* -------- USBCORE_UFRMHSET : (USBCORE Offset: 0x298) (R/W 32)  -------- */
#define USBCORE_UFRMHSET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMHSET)   Reset Value */

#define USBCORE_UFRMHSET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMHSET) Register Mask  */


/* -------- USBCORE_UFRMHINV : (USBCORE Offset: 0x29C) (R/W 32)  -------- */
#define USBCORE_UFRMHINV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UFRMHINV)   Reset Value */

#define USBCORE_UFRMHINV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UFRMHINV) Register Mask  */


/* -------- USBCORE_UTOK : (USBCORE Offset: 0x2A0) (R/W 32) USB Token Register -------- */
#define USBCORE_UTOK_EP_Pos                   _UINT32_(0)                                          /* (USBCORE_UTOK)  Position */
#define USBCORE_UTOK_EP_Msk                   (_UINT32_(0xF) << USBCORE_UTOK_EP_Pos)               /* (USBCORE_UTOK)  Mask */
#define USBCORE_UTOK_EP(value)                (USBCORE_UTOK_EP_Msk & (_UINT32_(value) << USBCORE_UTOK_EP_Pos)) /* Assigment of value for EP in the USBCORE_UTOK register */
#define USBCORE_UTOK_PID_Pos                  _UINT32_(4)                                          /* (USBCORE_UTOK) Token Type Indicator bits Position */
#define USBCORE_UTOK_PID_Msk                  (_UINT32_(0xF) << USBCORE_UTOK_PID_Pos)              /* (USBCORE_UTOK) Token Type Indicator bits Mask */
#define USBCORE_UTOK_PID(value)               (USBCORE_UTOK_PID_Msk & (_UINT32_(value) << USBCORE_UTOK_PID_Pos)) /* Assigment of value for PID in the USBCORE_UTOK register */
#define   USBCORE_UTOK_PID_OUT_Val            _UINT32_(0x1)                                        /* (USBCORE_UTOK) OUT (TX) token type transaction  */
#define   USBCORE_UTOK_PID_IN_Val             _UINT32_(0x9)                                        /* (USBCORE_UTOK) IN (RX) token type transaction  */
#define   USBCORE_UTOK_PID_SETUP_Val          _UINT32_(0xD)                                        /* (USBCORE_UTOK) SETUP (TX) token type transaction  */
#define USBCORE_UTOK_PID_OUT                  (USBCORE_UTOK_PID_OUT_Val << USBCORE_UTOK_PID_Pos)   /* (USBCORE_UTOK) OUT (TX) token type transaction Position  */
#define USBCORE_UTOK_PID_IN                   (USBCORE_UTOK_PID_IN_Val << USBCORE_UTOK_PID_Pos)    /* (USBCORE_UTOK) IN (RX) token type transaction Position  */
#define USBCORE_UTOK_PID_SETUP                (USBCORE_UTOK_PID_SETUP_Val << USBCORE_UTOK_PID_Pos) /* (USBCORE_UTOK) SETUP (TX) token type transaction Position  */
#define USBCORE_UTOK_Msk                      _UINT32_(0x000000FF)                                 /* (USBCORE_UTOK) Register Mask  */


/* -------- USBCORE_UTOKCLR : (USBCORE Offset: 0x2A4) (R/W 32)  -------- */
#define USBCORE_UTOKCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UTOKCLR)   Reset Value */

#define USBCORE_UTOKCLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UTOKCLR) Register Mask  */


/* -------- USBCORE_UTOKSET : (USBCORE Offset: 0x2A8) (R/W 32)  -------- */
#define USBCORE_UTOKSET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UTOKSET)   Reset Value */

#define USBCORE_UTOKSET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UTOKSET) Register Mask  */


/* -------- USBCORE_UTOKINV : (USBCORE Offset: 0x2AC) (R/W 32)  -------- */
#define USBCORE_UTOKINV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UTOKINV)   Reset Value */

#define USBCORE_UTOKINV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UTOKINV) Register Mask  */


/* -------- USBCORE_USOF : (USBCORE Offset: 0x2B0) (R/W 32) USB SOF Threshold Register -------- */
#define USBCORE_USOF_CNT_Pos                  _UINT32_(0)                                          /* (USBCORE_USOF) SOF Threshold Value bits Position */
#define USBCORE_USOF_CNT_Msk                  (_UINT32_(0xFF) << USBCORE_USOF_CNT_Pos)             /* (USBCORE_USOF) SOF Threshold Value bits Mask */
#define USBCORE_USOF_CNT(value)               (USBCORE_USOF_CNT_Msk & (_UINT32_(value) << USBCORE_USOF_CNT_Pos)) /* Assigment of value for CNT in the USBCORE_USOF register */
#define   USBCORE_USOF_CNT_BYTE64_Val         _UINT32_(0x4A)                                       /* (USBCORE_USOF) 64-byte packet  */
#define   USBCORE_USOF_CNT_BYTE32_Val         _UINT32_(0x2A)                                       /* (USBCORE_USOF) 32-byte packet  */
#define   USBCORE_USOF_CNT_BYTE16_Val         _UINT32_(0x1A)                                       /* (USBCORE_USOF) 16-byte packet  */
#define   USBCORE_USOF_CNT_BYTE8_Val          _UINT32_(0x12)                                       /* (USBCORE_USOF) 8-byte packet  */
#define USBCORE_USOF_CNT_BYTE64               (USBCORE_USOF_CNT_BYTE64_Val << USBCORE_USOF_CNT_Pos) /* (USBCORE_USOF) 64-byte packet Position  */
#define USBCORE_USOF_CNT_BYTE32               (USBCORE_USOF_CNT_BYTE32_Val << USBCORE_USOF_CNT_Pos) /* (USBCORE_USOF) 32-byte packet Position  */
#define USBCORE_USOF_CNT_BYTE16               (USBCORE_USOF_CNT_BYTE16_Val << USBCORE_USOF_CNT_Pos) /* (USBCORE_USOF) 16-byte packet Position  */
#define USBCORE_USOF_CNT_BYTE8                (USBCORE_USOF_CNT_BYTE8_Val << USBCORE_USOF_CNT_Pos) /* (USBCORE_USOF) 8-byte packet Position  */
#define USBCORE_USOF_Msk                      _UINT32_(0x000000FF)                                 /* (USBCORE_USOF) Register Mask  */


/* -------- USBCORE_USOFCLR : (USBCORE Offset: 0x2B4) (R/W 32)  -------- */
#define USBCORE_USOFCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_USOFCLR)   Reset Value */

#define USBCORE_USOFCLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_USOFCLR) Register Mask  */


/* -------- USBCORE_USOFSET : (USBCORE Offset: 0x2B8) (R/W 32)  -------- */
#define USBCORE_USOFSET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_USOFSET)   Reset Value */

