Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
#define USBCORE_UCNFG1INV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UCNFG1INV) Register Mask  */


/* -------- USBCORE_UEP0 : (USBCORE Offset: 0x300) (R/W 32) USB Endpoint Control Register 0 -------- */
#define USBCORE_UEP0_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP0) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP0_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP0_EPHSHK_Pos)           /* (USBCORE_UEP0) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP0_EPHSHK(value)            (USBCORE_UEP0_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP0_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP0) Endpoint Handshake is enabled  */
#define   USBCORE_UEP0_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP0) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP0_EPHSHK_ON                (USBCORE_UEP0_EPHSHK_ON_Val << USBCORE_UEP0_EPHSHK_Pos) /* (USBCORE_UEP0) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP0_EPHSHK_OFF               (USBCORE_UEP0_EPHSHK_OFF_Val << USBCORE_UEP0_EPHSHK_Pos) /* (USBCORE_UEP0) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP0_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP0) Endpoint Stall Status bit Position */
#define USBCORE_UEP0_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP0_EPSTALL_Pos)          /* (USBCORE_UEP0) Endpoint Stall Status bit Mask */
#define USBCORE_UEP0_EPSTALL(value)           (USBCORE_UEP0_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP0_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP0) Endpoint 0 was stalled  */
#define   USBCORE_UEP0_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP0) Endpoint 0 was not stalled  */
#define USBCORE_UEP0_EPSTALL_STALL            (USBCORE_UEP0_EPSTALL_STALL_Val << USBCORE_UEP0_EPSTALL_Pos) /* (USBCORE_UEP0) Endpoint 0 was stalled Position  */
#define USBCORE_UEP0_EPSTALL_NOT_STALL        (USBCORE_UEP0_EPSTALL_NOT_STALL_Val << USBCORE_UEP0_EPSTALL_Pos) /* (USBCORE_UEP0) Endpoint 0 was not stalled Position  */
#define USBCORE_UEP0_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP0) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP0_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP0_EPTXEN_Pos)           /* (USBCORE_UEP0) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP0_EPTXEN(value)            (USBCORE_UEP0_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP0_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP0) Endpoint 0 transmit is enabled  */
#define   USBCORE_UEP0_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP0) Endpoint 0 transmit is disabled  */
#define USBCORE_UEP0_EPTXEN_ON                (USBCORE_UEP0_EPTXEN_ON_Val << USBCORE_UEP0_EPTXEN_Pos) /* (USBCORE_UEP0) Endpoint 0 transmit is enabled Position  */
#define USBCORE_UEP0_EPTXEN_OFF               (USBCORE_UEP0_EPTXEN_OFF_Val << USBCORE_UEP0_EPTXEN_Pos) /* (USBCORE_UEP0) Endpoint 0 transmit is disabled Position  */
#define USBCORE_UEP0_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP0) Endpoint Receive Enable bit Position */
#define USBCORE_UEP0_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP0_EPRXEN_Pos)           /* (USBCORE_UEP0) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP0_EPRXEN(value)            (USBCORE_UEP0_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP0_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP0) Endpoint 0 receive is enabled  */
#define   USBCORE_UEP0_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP0) Endpoint 0 receive is disabled  */
#define USBCORE_UEP0_EPRXEN_ON                (USBCORE_UEP0_EPRXEN_ON_Val << USBCORE_UEP0_EPRXEN_Pos) /* (USBCORE_UEP0) Endpoint 0 receive is enabled Position  */
#define USBCORE_UEP0_EPRXEN_OFF               (USBCORE_UEP0_EPRXEN_OFF_Val << USBCORE_UEP0_EPRXEN_Pos) /* (USBCORE_UEP0) Endpoint 0 receive is disabled Position  */
#define USBCORE_UEP0_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP0) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP0_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP0_EPCONDIS_Pos)         /* (USBCORE_UEP0) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP0_EPCONDIS(value)          (USBCORE_UEP0_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP0_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_EPCONDIS_DISABLE_0_Val _UINT32_(0x1)                                        /* (USBCORE_UEP0) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 0 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP0_EPCONDIS_ENABLE_0_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP0) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 0 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP0_EPCONDIS_DISABLE_0       (USBCORE_UEP0_EPCONDIS_DISABLE_0_Val << USBCORE_UEP0_EPCONDIS_Pos) /* (USBCORE_UEP0) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 0 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP0_EPCONDIS_ENABLE_0        (USBCORE_UEP0_EPCONDIS_ENABLE_0_Val << USBCORE_UEP0_EPCONDIS_Pos) /* (USBCORE_UEP0) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 0 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP0_RETRYDIS_Pos             _UINT32_(6)                                          /* (USBCORE_UEP0) Retry Disable bit Position */
#define USBCORE_UEP0_RETRYDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP0_RETRYDIS_Pos)         /* (USBCORE_UEP0) Retry Disable bit Mask */
#define USBCORE_UEP0_RETRYDIS(value)          (USBCORE_UEP0_RETRYDIS_Msk & (_UINT32_(value) << USBCORE_UEP0_RETRYDIS_Pos)) /* Assigment of value for RETRYDIS in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_RETRYDIS_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_UEP0) Retry NAKed transactions is disabled  */
#define   USBCORE_UEP0_RETRYDIS_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_UEP0) Retry NAKed transactions is enabled; retry done in hardware  */
#define USBCORE_UEP0_RETRYDIS_ON              (USBCORE_UEP0_RETRYDIS_ON_Val << USBCORE_UEP0_RETRYDIS_Pos) /* (USBCORE_UEP0) Retry NAKed transactions is disabled Position  */
#define USBCORE_UEP0_RETRYDIS_OFF             (USBCORE_UEP0_RETRYDIS_OFF_Val << USBCORE_UEP0_RETRYDIS_Pos) /* (USBCORE_UEP0) Retry NAKed transactions is enabled; retry done in hardware Position  */
#define USBCORE_UEP0_LSPD_Pos                 _UINT32_(7)                                          /* (USBCORE_UEP0) Low-Speed Direct Connection Enable bit Position */
#define USBCORE_UEP0_LSPD_Msk                 (_UINT32_(0x1) << USBCORE_UEP0_LSPD_Pos)             /* (USBCORE_UEP0) Low-Speed Direct Connection Enable bit Mask */
#define USBCORE_UEP0_LSPD(value)              (USBCORE_UEP0_LSPD_Msk & (_UINT32_(value) << USBCORE_UEP0_LSPD_Pos)) /* Assigment of value for LSPD in the USBCORE_UEP0 register */
#define   USBCORE_UEP0_LSPD_ON_Val            _UINT32_(0x1)                                        /* (USBCORE_UEP0) Direct connection to a low-speed device is enabled  */
#define   USBCORE_UEP0_LSPD_OFF_Val           _UINT32_(0x0)                                        /* (USBCORE_UEP0) Direct connection to a low-speed device is disabled; hub required with PRE_PID  */
#define USBCORE_UEP0_LSPD_ON                  (USBCORE_UEP0_LSPD_ON_Val << USBCORE_UEP0_LSPD_Pos)  /* (USBCORE_UEP0) Direct connection to a low-speed device is enabled Position  */
#define USBCORE_UEP0_LSPD_OFF                 (USBCORE_UEP0_LSPD_OFF_Val << USBCORE_UEP0_LSPD_Pos) /* (USBCORE_UEP0) Direct connection to a low-speed device is disabled; hub required with PRE_PID Position  */
#define USBCORE_UEP0_Msk                      _UINT32_(0x000000DF)                                 /* (USBCORE_UEP0) Register Mask  */


/* -------- USBCORE_UEP0CLR : (USBCORE Offset: 0x304) (R/W 32)  -------- */
#define USBCORE_UEP0CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP0CLR)   Reset Value */

#define USBCORE_UEP0CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP0CLR) Register Mask  */


/* -------- USBCORE_UEP0SET : (USBCORE Offset: 0x308) (R/W 32)  -------- */
#define USBCORE_UEP0SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP0SET)   Reset Value */

