Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UEP3INV : (USBCORE Offset: 0x33C) (R/W 32)  -------- */
#define USBCORE_UEP3INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP3INV)   Reset Value */

#define USBCORE_UEP3INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP3INV) Register Mask  */


/* -------- USBCORE_UEP4 : (USBCORE Offset: 0x340) (R/W 32) USB Endpoint Control Register 4 -------- */
#define USBCORE_UEP4_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP4) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP4_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP4_EPHSHK_Pos)           /* (USBCORE_UEP4) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP4_EPHSHK(value)            (USBCORE_UEP4_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP4_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP4 register */
#define   USBCORE_UEP4_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP4) Endpoint Handshake is enabled  */
#define   USBCORE_UEP4_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP4) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP4_EPHSHK_ON                (USBCORE_UEP4_EPHSHK_ON_Val << USBCORE_UEP4_EPHSHK_Pos) /* (USBCORE_UEP4) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP4_EPHSHK_OFF               (USBCORE_UEP4_EPHSHK_OFF_Val << USBCORE_UEP4_EPHSHK_Pos) /* (USBCORE_UEP4) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP4_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP4) Endpoint Stall Status bit Position */
#define USBCORE_UEP4_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP4_EPSTALL_Pos)          /* (USBCORE_UEP4) Endpoint Stall Status bit Mask */
#define USBCORE_UEP4_EPSTALL(value)           (USBCORE_UEP4_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP4_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP4 register */
#define   USBCORE_UEP4_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP4) Endpoint 4 was stalled  */
#define   USBCORE_UEP4_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP4) Endpoint 4 was not stalled  */
#define USBCORE_UEP4_EPSTALL_STALL            (USBCORE_UEP4_EPSTALL_STALL_Val << USBCORE_UEP4_EPSTALL_Pos) /* (USBCORE_UEP4) Endpoint 4 was stalled Position  */
#define USBCORE_UEP4_EPSTALL_NOT_STALL        (USBCORE_UEP4_EPSTALL_NOT_STALL_Val << USBCORE_UEP4_EPSTALL_Pos) /* (USBCORE_UEP4) Endpoint 4 was not stalled Position  */
#define USBCORE_UEP4_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP4) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP4_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP4_EPTXEN_Pos)           /* (USBCORE_UEP4) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP4_EPTXEN(value)            (USBCORE_UEP4_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP4_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP4 register */
#define   USBCORE_UEP4_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP4) Endpoint 4 transmit is enabled  */
#define   USBCORE_UEP4_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP4) Endpoint 4 transmit is disabled  */
#define USBCORE_UEP4_EPTXEN_ON                (USBCORE_UEP4_EPTXEN_ON_Val << USBCORE_UEP4_EPTXEN_Pos) /* (USBCORE_UEP4) Endpoint 4 transmit is enabled Position  */
#define USBCORE_UEP4_EPTXEN_OFF               (USBCORE_UEP4_EPTXEN_OFF_Val << USBCORE_UEP4_EPTXEN_Pos) /* (USBCORE_UEP4) Endpoint 4 transmit is disabled Position  */
#define USBCORE_UEP4_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP4) Endpoint Receive Enable bit Position */
#define USBCORE_UEP4_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP4_EPRXEN_Pos)           /* (USBCORE_UEP4) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP4_EPRXEN(value)            (USBCORE_UEP4_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP4_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP4 register */
#define   USBCORE_UEP4_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP4) Endpoint 4 receive is enabled  */
#define   USBCORE_UEP4_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP4) Endpoint 4 receive is disabled  */
#define USBCORE_UEP4_EPRXEN_ON                (USBCORE_UEP4_EPRXEN_ON_Val << USBCORE_UEP4_EPRXEN_Pos) /* (USBCORE_UEP4) Endpoint 4 receive is enabled Position  */
#define USBCORE_UEP4_EPRXEN_OFF               (USBCORE_UEP4_EPRXEN_OFF_Val << USBCORE_UEP4_EPRXEN_Pos) /* (USBCORE_UEP4) Endpoint 4 receive is disabled Position  */
#define USBCORE_UEP4_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP4) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP4_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP4_EPCONDIS_Pos)         /* (USBCORE_UEP4) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP4_EPCONDIS(value)          (USBCORE_UEP4_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP4_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP4 register */
#define   USBCORE_UEP4_EPCONDIS_DISABLE_4_Val _UINT32_(0x1)                                        /* (USBCORE_UEP4) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 4 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP4_EPCONDIS_ENABLE_4_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP4) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 4 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP4_EPCONDIS_DISABLE_4       (USBCORE_UEP4_EPCONDIS_DISABLE_4_Val << USBCORE_UEP4_EPCONDIS_Pos) /* (USBCORE_UEP4) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 4 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP4_EPCONDIS_ENABLE_4        (USBCORE_UEP4_EPCONDIS_ENABLE_4_Val << USBCORE_UEP4_EPCONDIS_Pos) /* (USBCORE_UEP4) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 4 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP4_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP4) Register Mask  */


/* -------- USBCORE_UEP4CLR : (USBCORE Offset: 0x344) (R/W 32)  -------- */
#define USBCORE_UEP4CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP4CLR)   Reset Value */

#define USBCORE_UEP4CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP4CLR) Register Mask  */


