Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UEP4SET : (USBCORE Offset: 0x348) (R/W 32)  -------- */
#define USBCORE_UEP4SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP4SET)   Reset Value */

#define USBCORE_UEP4SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP4SET) Register Mask  */


/* -------- USBCORE_UEP4INV : (USBCORE Offset: 0x34C) (R/W 32)  -------- */
#define USBCORE_UEP4INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP4INV)   Reset Value */

#define USBCORE_UEP4INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP4INV) Register Mask  */


/* -------- USBCORE_UEP5 : (USBCORE Offset: 0x350) (R/W 32) USB Endpoint Control Register 5 -------- */
#define USBCORE_UEP5_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP5) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP5_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP5_EPHSHK_Pos)           /* (USBCORE_UEP5) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP5_EPHSHK(value)            (USBCORE_UEP5_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP5_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP5 register */
#define   USBCORE_UEP5_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP5) Endpoint Handshake is enabled  */
#define   USBCORE_UEP5_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP5) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP5_EPHSHK_ON                (USBCORE_UEP5_EPHSHK_ON_Val << USBCORE_UEP5_EPHSHK_Pos) /* (USBCORE_UEP5) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP5_EPHSHK_OFF               (USBCORE_UEP5_EPHSHK_OFF_Val << USBCORE_UEP5_EPHSHK_Pos) /* (USBCORE_UEP5) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP5_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP5) Endpoint Stall Status bit Position */
#define USBCORE_UEP5_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP5_EPSTALL_Pos)          /* (USBCORE_UEP5) Endpoint Stall Status bit Mask */
#define USBCORE_UEP5_EPSTALL(value)           (USBCORE_UEP5_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP5_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP5 register */
#define   USBCORE_UEP5_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP5) Endpoint 5 was stalled  */
#define   USBCORE_UEP5_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP5) Endpoint 5 was not stalled  */
#define USBCORE_UEP5_EPSTALL_STALL            (USBCORE_UEP5_EPSTALL_STALL_Val << USBCORE_UEP5_EPSTALL_Pos) /* (USBCORE_UEP5) Endpoint 5 was stalled Position  */
#define USBCORE_UEP5_EPSTALL_NOT_STALL        (USBCORE_UEP5_EPSTALL_NOT_STALL_Val << USBCORE_UEP5_EPSTALL_Pos) /* (USBCORE_UEP5) Endpoint 5 was not stalled Position  */
#define USBCORE_UEP5_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP5) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP5_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP5_EPTXEN_Pos)           /* (USBCORE_UEP5) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP5_EPTXEN(value)            (USBCORE_UEP5_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP5_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP5 register */
#define   USBCORE_UEP5_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP5) Endpoint 5 transmit is enabled  */
#define   USBCORE_UEP5_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP5) Endpoint 5 transmit is disabled  */
#define USBCORE_UEP5_EPTXEN_ON                (USBCORE_UEP5_EPTXEN_ON_Val << USBCORE_UEP5_EPTXEN_Pos) /* (USBCORE_UEP5) Endpoint 5 transmit is enabled Position  */
#define USBCORE_UEP5_EPTXEN_OFF               (USBCORE_UEP5_EPTXEN_OFF_Val << USBCORE_UEP5_EPTXEN_Pos) /* (USBCORE_UEP5) Endpoint 5 transmit is disabled Position  */
#define USBCORE_UEP5_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP5) Endpoint Receive Enable bit Position */
#define USBCORE_UEP5_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP5_EPRXEN_Pos)           /* (USBCORE_UEP5) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP5_EPRXEN(value)            (USBCORE_UEP5_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP5_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP5 register */
#define   USBCORE_UEP5_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP5) Endpoint 5 receive is enabled  */
#define   USBCORE_UEP5_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP5) Endpoint 5 receive is disabled  */
#define USBCORE_UEP5_EPRXEN_ON                (USBCORE_UEP5_EPRXEN_ON_Val << USBCORE_UEP5_EPRXEN_Pos) /* (USBCORE_UEP5) Endpoint 5 receive is enabled Position  */
#define USBCORE_UEP5_EPRXEN_OFF               (USBCORE_UEP5_EPRXEN_OFF_Val << USBCORE_UEP5_EPRXEN_Pos) /* (USBCORE_UEP5) Endpoint 5 receive is disabled Position  */
#define USBCORE_UEP5_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP5) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP5_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP5_EPCONDIS_Pos)         /* (USBCORE_UEP5) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP5_EPCONDIS(value)          (USBCORE_UEP5_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP5_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP5 register */
#define   USBCORE_UEP5_EPCONDIS_DISABLE_5_Val _UINT32_(0x1)                                        /* (USBCORE_UEP5) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 5 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP5_EPCONDIS_ENABLE_5_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP5) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 5 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP5_EPCONDIS_DISABLE_5       (USBCORE_UEP5_EPCONDIS_DISABLE_5_Val << USBCORE_UEP5_EPCONDIS_Pos) /* (USBCORE_UEP5) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 5 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP5_EPCONDIS_ENABLE_5        (USBCORE_UEP5_EPCONDIS_ENABLE_5_Val << USBCORE_UEP5_EPCONDIS_Pos) /* (USBCORE_UEP5) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 5 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP5_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP5) Register Mask  */


/* -------- USBCORE_UEP5CLR : (USBCORE Offset: 0x354) (R/W 32)  -------- */
#define USBCORE_UEP5CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP5CLR)   Reset Value */

#define USBCORE_UEP5CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP5CLR) Register Mask  */


/* -------- USBCORE_UEP5SET : (USBCORE Offset: 0x358) (R/W 32)  -------- */
#define USBCORE_UEP5SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP5SET)   Reset Value */

#define USBCORE_UEP5SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP5SET) Register Mask  */


/* -------- USBCORE_UEP5INV : (USBCORE Offset: 0x35C) (R/W 32)  -------- */
#define USBCORE_UEP5INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP5INV)   Reset Value */

