Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
#define USBCORE_UEP7CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP7CLR) Register Mask  */


/* -------- USBCORE_UEP7SET : (USBCORE Offset: 0x378) (R/W 32)  -------- */
#define USBCORE_UEP7SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP7SET)   Reset Value */

#define USBCORE_UEP7SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP7SET) Register Mask  */


/* -------- USBCORE_UEP7INV : (USBCORE Offset: 0x37C) (R/W 32)  -------- */
#define USBCORE_UEP7INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP7INV)   Reset Value */

#define USBCORE_UEP7INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP7INV) Register Mask  */


/* -------- USBCORE_U1EP8 : (USBCORE Offset: 0x380) (R/W 32) USB Endpoint Control Register 8 -------- */
#define USBCORE_U1EP8_EPHSHK_Pos              _UINT32_(0)                                          /* (USBCORE_U1EP8) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP8_EPHSHK_Msk              (_UINT32_(0x1) << USBCORE_U1EP8_EPHSHK_Pos)          /* (USBCORE_U1EP8) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP8_EPHSHK(value)           (USBCORE_U1EP8_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP8_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP8 register */
#define   USBCORE_U1EP8_EPHSHK_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP8) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP8_EPHSHK_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP8) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP8_EPHSHK_ON               (USBCORE_U1EP8_EPHSHK_ON_Val << USBCORE_U1EP8_EPHSHK_Pos) /* (USBCORE_U1EP8) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP8_EPHSHK_OFF              (USBCORE_U1EP8_EPHSHK_OFF_Val << USBCORE_U1EP8_EPHSHK_Pos) /* (USBCORE_U1EP8) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP8_EPSTALL_Pos             _UINT32_(1)                                          /* (USBCORE_U1EP8) Endpoint Stall Status bit Position */
#define USBCORE_U1EP8_EPSTALL_Msk             (_UINT32_(0x1) << USBCORE_U1EP8_EPSTALL_Pos)         /* (USBCORE_U1EP8) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP8_EPSTALL(value)          (USBCORE_U1EP8_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP8_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP8 register */
#define   USBCORE_U1EP8_EPSTALL_STALL_Val     _UINT32_(0x1)                                        /* (USBCORE_U1EP8) Endpoint 8 was stalled  */
#define   USBCORE_U1EP8_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP8) Endpoint 8 was not stalled  */
#define USBCORE_U1EP8_EPSTALL_STALL           (USBCORE_U1EP8_EPSTALL_STALL_Val << USBCORE_U1EP8_EPSTALL_Pos) /* (USBCORE_U1EP8) Endpoint 8 was stalled Position  */
#define USBCORE_U1EP8_EPSTALL_NOT_STALL       (USBCORE_U1EP8_EPSTALL_NOT_STALL_Val << USBCORE_U1EP8_EPSTALL_Pos) /* (USBCORE_U1EP8) Endpoint 8 was not stalled Position  */
#define USBCORE_U1EP8_EPTXEN_Pos              _UINT32_(2)                                          /* (USBCORE_U1EP8) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP8_EPTXEN_Msk              (_UINT32_(0x1) << USBCORE_U1EP8_EPTXEN_Pos)          /* (USBCORE_U1EP8) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP8_EPTXEN(value)           (USBCORE_U1EP8_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP8_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP8 register */
#define   USBCORE_U1EP8_EPTXEN_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP8) Endpoint 8 transmit is enabled  */
#define   USBCORE_U1EP8_EPTXEN_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP8) Endpoint 8 transmit is disabled  */
#define USBCORE_U1EP8_EPTXEN_ON               (USBCORE_U1EP8_EPTXEN_ON_Val << USBCORE_U1EP8_EPTXEN_Pos) /* (USBCORE_U1EP8) Endpoint 8 transmit is enabled Position  */
#define USBCORE_U1EP8_EPTXEN_OFF              (USBCORE_U1EP8_EPTXEN_OFF_Val << USBCORE_U1EP8_EPTXEN_Pos) /* (USBCORE_U1EP8) Endpoint 8 transmit is disabled Position  */
#define USBCORE_U1EP8_EPRXEN_Pos              _UINT32_(3)                                          /* (USBCORE_U1EP8) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP8_EPRXEN_Msk              (_UINT32_(0x1) << USBCORE_U1EP8_EPRXEN_Pos)          /* (USBCORE_U1EP8) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP8_EPRXEN(value)           (USBCORE_U1EP8_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP8_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP8 register */
#define   USBCORE_U1EP8_EPRXEN_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP8) Endpoint 8 receive is enabled  */
#define   USBCORE_U1EP8_EPRXEN_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP8) Endpoint 8 receive is disabled  */
#define USBCORE_U1EP8_EPRXEN_ON               (USBCORE_U1EP8_EPRXEN_ON_Val << USBCORE_U1EP8_EPRXEN_Pos) /* (USBCORE_U1EP8) Endpoint 8 receive is enabled Position  */
#define USBCORE_U1EP8_EPRXEN_OFF              (USBCORE_U1EP8_EPRXEN_OFF_Val << USBCORE_U1EP8_EPRXEN_Pos) /* (USBCORE_U1EP8) Endpoint 8 receive is disabled Position  */
#define USBCORE_U1EP8_EPCONDIS_Pos            _UINT32_(4)                                          /* (USBCORE_U1EP8) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP8_EPCONDIS_Msk            (_UINT32_(0x1) << USBCORE_U1EP8_EPCONDIS_Pos)        /* (USBCORE_U1EP8) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP8_EPCONDIS(value)         (USBCORE_U1EP8_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP8_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP8 register */
#define   USBCORE_U1EP8_EPCONDIS_DISABLE_8_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP8) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 8 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP8_EPCONDIS_ENABLE_8_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP8) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 8 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP8_EPCONDIS_DISABLE_8      (USBCORE_U1EP8_EPCONDIS_DISABLE_8_Val << USBCORE_U1EP8_EPCONDIS_Pos) /* (USBCORE_U1EP8) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 8 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP8_EPCONDIS_ENABLE_8       (USBCORE_U1EP8_EPCONDIS_ENABLE_8_Val << USBCORE_U1EP8_EPCONDIS_Pos) /* (USBCORE_U1EP8) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 8 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP8_Msk                     _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP8) Register Mask  */


/* -------- USBCORE_UEP8CLR : (USBCORE Offset: 0x384) (R/W 32)  -------- */
#define USBCORE_UEP8CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP8CLR)   Reset Value */

#define USBCORE_UEP8CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP8CLR) Register Mask  */


/* -------- USBCORE_UEP8SET : (USBCORE Offset: 0x388) (R/W 32)  -------- */
#define USBCORE_UEP8SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP8SET)   Reset Value */

#define USBCORE_UEP8SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP8SET) Register Mask  */


/* -------- USBCORE_UEP8INV : (USBCORE Offset: 0x38C) (R/W 32)  -------- */
#define USBCORE_UEP8INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP8INV)   Reset Value */

#define USBCORE_UEP8INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP8INV) Register Mask  */


/* -------- USBCORE_U1EP9 : (USBCORE Offset: 0x390) (R/W 32) USB Endpoint Control Register 9 -------- */
#define USBCORE_U1EP9_EPHSHK_Pos              _UINT32_(0)                                          /* (USBCORE_U1EP9) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP9_EPHSHK_Msk              (_UINT32_(0x1) << USBCORE_U1EP9_EPHSHK_Pos)          /* (USBCORE_U1EP9) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP9_EPHSHK(value)           (USBCORE_U1EP9_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP9_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP9 register */
#define   USBCORE_U1EP9_EPHSHK_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP9) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP9_EPHSHK_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP9) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP9_EPHSHK_ON               (USBCORE_U1EP9_EPHSHK_ON_Val << USBCORE_U1EP9_EPHSHK_Pos) /* (USBCORE_U1EP9) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP9_EPHSHK_OFF              (USBCORE_U1EP9_EPHSHK_OFF_Val << USBCORE_U1EP9_EPHSHK_Pos) /* (USBCORE_U1EP9) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP9_EPSTALL_Pos             _UINT32_(1)                                          /* (USBCORE_U1EP9) Endpoint Stall Status bit Position */
#define USBCORE_U1EP9_EPSTALL_Msk             (_UINT32_(0x1) << USBCORE_U1EP9_EPSTALL_Pos)         /* (USBCORE_U1EP9) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP9_EPSTALL(value)          (USBCORE_U1EP9_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP9_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP9 register */
#define   USBCORE_U1EP9_EPSTALL_STALL_Val     _UINT32_(0x1)                                        /* (USBCORE_U1EP9) Endpoint 9 was stalled  */
#define   USBCORE_U1EP9_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP9) Endpoint 9 was not stalled  */
#define USBCORE_U1EP9_EPSTALL_STALL           (USBCORE_U1EP9_EPSTALL_STALL_Val << USBCORE_U1EP9_EPSTALL_Pos) /* (USBCORE_U1EP9) Endpoint 9 was stalled Position  */
#define USBCORE_U1EP9_EPSTALL_NOT_STALL       (USBCORE_U1EP9_EPSTALL_NOT_STALL_Val << USBCORE_U1EP9_EPSTALL_Pos) /* (USBCORE_U1EP9) Endpoint 9 was not stalled Position  */
#define USBCORE_U1EP9_EPTXEN_Pos              _UINT32_(2)                                          /* (USBCORE_U1EP9) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP9_EPTXEN_Msk              (_UINT32_(0x1) << USBCORE_U1EP9_EPTXEN_Pos)          /* (USBCORE_U1EP9) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP9_EPTXEN(value)           (USBCORE_U1EP9_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP9_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP9 register */
#define   USBCORE_U1EP9_EPTXEN_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP9) Endpoint 9 transmit is enabled  */
#define   USBCORE_U1EP9_EPTXEN_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP9) Endpoint 9 transmit is disabled  */
#define USBCORE_U1EP9_EPTXEN_ON               (USBCORE_U1EP9_EPTXEN_ON_Val << USBCORE_U1EP9_EPTXEN_Pos) /* (USBCORE_U1EP9) Endpoint 9 transmit is enabled Position  */
#define USBCORE_U1EP9_EPTXEN_OFF              (USBCORE_U1EP9_EPTXEN_OFF_Val << USBCORE_U1EP9_EPTXEN_Pos) /* (USBCORE_U1EP9) Endpoint 9 transmit is disabled Position  */
#define USBCORE_U1EP9_EPRXEN_Pos              _UINT32_(3)                                          /* (USBCORE_U1EP9) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP9_EPRXEN_Msk              (_UINT32_(0x1) << USBCORE_U1EP9_EPRXEN_Pos)          /* (USBCORE_U1EP9) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP9_EPRXEN(value)           (USBCORE_U1EP9_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP9_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP9 register */
#define   USBCORE_U1EP9_EPRXEN_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_U1EP9) Endpoint 9 receive is enabled  */
#define   USBCORE_U1EP9_EPRXEN_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_U1EP9) Endpoint 9 receive is disabled  */
#define USBCORE_U1EP9_EPRXEN_ON               (USBCORE_U1EP9_EPRXEN_ON_Val << USBCORE_U1EP9_EPRXEN_Pos) /* (USBCORE_U1EP9) Endpoint 9 receive is enabled Position  */
#define USBCORE_U1EP9_EPRXEN_OFF              (USBCORE_U1EP9_EPRXEN_OFF_Val << USBCORE_U1EP9_EPRXEN_Pos) /* (USBCORE_U1EP9) Endpoint 9 receive is disabled Position  */
#define USBCORE_U1EP9_EPCONDIS_Pos            _UINT32_(4)                                          /* (USBCORE_U1EP9) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP9_EPCONDIS_Msk            (_UINT32_(0x1) << USBCORE_U1EP9_EPCONDIS_Pos)        /* (USBCORE_U1EP9) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP9_EPCONDIS(value)         (USBCORE_U1EP9_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP9_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP9 register */
#define   USBCORE_U1EP9_EPCONDIS_DISABLE_9_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP9) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 9 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP9_EPCONDIS_ENABLE_9_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP9) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 9 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP9_EPCONDIS_DISABLE_9      (USBCORE_U1EP9_EPCONDIS_DISABLE_9_Val << USBCORE_U1EP9_EPCONDIS_Pos) /* (USBCORE_U1EP9) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 9 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP9_EPCONDIS_ENABLE_9       (USBCORE_U1EP9_EPCONDIS_ENABLE_9_Val << USBCORE_U1EP9_EPCONDIS_Pos) /* (USBCORE_U1EP9) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 9 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP9_Msk                     _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP9) Register Mask  */


/* -------- USBCORE_UEP9CLR : (USBCORE Offset: 0x394) (R/W 32)  -------- */
#define USBCORE_UEP9CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP9CLR)   Reset Value */

#define USBCORE_UEP9CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP9CLR) Register Mask  */


