Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UEP10CLR : (USBCORE Offset: 0x3A4) (R/W 32)  -------- */
#define USBCORE_UEP10CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP10CLR)   Reset Value */

#define USBCORE_UEP10CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP10CLR) Register Mask  */


/* -------- USBCORE_UEP10SET : (USBCORE Offset: 0x3A8) (R/W 32)  -------- */
#define USBCORE_UEP10SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP10SET)   Reset Value */

#define USBCORE_UEP10SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP10SET) Register Mask  */


/* -------- USBCORE_UEP10INV : (USBCORE Offset: 0x3AC) (R/W 32)  -------- */
#define USBCORE_UEP10INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP10INV)   Reset Value */

#define USBCORE_UEP10INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP10INV) Register Mask  */


/* -------- USBCORE_U1EP11 : (USBCORE Offset: 0x3B0) (R/W 32) USB Endpoint Control Register 11 -------- */
#define USBCORE_U1EP11_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP11) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP11_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP11_EPHSHK_Pos)         /* (USBCORE_U1EP11) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP11_EPHSHK(value)          (USBCORE_U1EP11_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP11_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP11 register */
#define   USBCORE_U1EP11_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP11) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP11_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP11) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP11_EPHSHK_ON              (USBCORE_U1EP11_EPHSHK_ON_Val << USBCORE_U1EP11_EPHSHK_Pos) /* (USBCORE_U1EP11) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP11_EPHSHK_OFF             (USBCORE_U1EP11_EPHSHK_OFF_Val << USBCORE_U1EP11_EPHSHK_Pos) /* (USBCORE_U1EP11) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP11_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP11) Endpoint Stall Status bit Position */
#define USBCORE_U1EP11_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP11_EPSTALL_Pos)        /* (USBCORE_U1EP11) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP11_EPSTALL(value)         (USBCORE_U1EP11_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP11_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP11 register */
#define   USBCORE_U1EP11_EPSTALL_STALL_Val    _UINT32_(0x1)                                        /* (USBCORE_U1EP11) Endpoint 11 was stalled  */
#define   USBCORE_U1EP11_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP11) Endpoint 11 was not stalled  */
#define USBCORE_U1EP11_EPSTALL_STALL          (USBCORE_U1EP11_EPSTALL_STALL_Val << USBCORE_U1EP11_EPSTALL_Pos) /* (USBCORE_U1EP11) Endpoint 11 was stalled Position  */
#define USBCORE_U1EP11_EPSTALL_NOT_STALL      (USBCORE_U1EP11_EPSTALL_NOT_STALL_Val << USBCORE_U1EP11_EPSTALL_Pos) /* (USBCORE_U1EP11) Endpoint 11 was not stalled Position  */
#define USBCORE_U1EP11_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP11) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP11_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP11_EPTXEN_Pos)         /* (USBCORE_U1EP11) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP11_EPTXEN(value)          (USBCORE_U1EP11_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP11_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP11 register */
#define   USBCORE_U1EP11_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP11) Endpoint 11 transmit is enabled  */
#define   USBCORE_U1EP11_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP11) Endpoint 11 transmit is disabled  */
#define USBCORE_U1EP11_EPTXEN_ON              (USBCORE_U1EP11_EPTXEN_ON_Val << USBCORE_U1EP11_EPTXEN_Pos) /* (USBCORE_U1EP11) Endpoint 11 transmit is enabled Position  */
#define USBCORE_U1EP11_EPTXEN_OFF             (USBCORE_U1EP11_EPTXEN_OFF_Val << USBCORE_U1EP11_EPTXEN_Pos) /* (USBCORE_U1EP11) Endpoint 11 transmit is disabled Position  */
#define USBCORE_U1EP11_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP11) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP11_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP11_EPRXEN_Pos)         /* (USBCORE_U1EP11) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP11_EPRXEN(value)          (USBCORE_U1EP11_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP11_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP11 register */
#define   USBCORE_U1EP11_EPRXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP11) Endpoint 11 receive is enabled  */
#define   USBCORE_U1EP11_EPRXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP11) Endpoint 11 receive is disabled  */
#define USBCORE_U1EP11_EPRXEN_ON              (USBCORE_U1EP11_EPRXEN_ON_Val << USBCORE_U1EP11_EPRXEN_Pos) /* (USBCORE_U1EP11) Endpoint 11 receive is enabled Position  */
#define USBCORE_U1EP11_EPRXEN_OFF             (USBCORE_U1EP11_EPRXEN_OFF_Val << USBCORE_U1EP11_EPRXEN_Pos) /* (USBCORE_U1EP11) Endpoint 11 receive is disabled Position  */
#define USBCORE_U1EP11_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP11) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP11_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP11_EPCONDIS_Pos)       /* (USBCORE_U1EP11) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP11_EPCONDIS(value)        (USBCORE_U1EP11_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP11_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP11 register */
#define   USBCORE_U1EP11_EPCONDIS_DISABLE_11_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP11) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 11 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP11_EPCONDIS_ENABLE_11_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP11) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 11 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP11_EPCONDIS_DISABLE_11    (USBCORE_U1EP11_EPCONDIS_DISABLE_11_Val << USBCORE_U1EP11_EPCONDIS_Pos) /* (USBCORE_U1EP11) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 11 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP11_EPCONDIS_ENABLE_11     (USBCORE_U1EP11_EPCONDIS_ENABLE_11_Val << USBCORE_U1EP11_EPCONDIS_Pos) /* (USBCORE_U1EP11) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 11 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP11_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP11) Register Mask  */


/* -------- USBCORE_UEP11CLR : (USBCORE Offset: 0x3B4) (R/W 32)  -------- */
#define USBCORE_UEP11CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP11CLR)   Reset Value */

#define USBCORE_UEP11CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP11CLR) Register Mask  */


/* -------- USBCORE_UEP11SET : (USBCORE Offset: 0x3B8) (R/W 32)  -------- */
#define USBCORE_UEP11SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP11SET)   Reset Value */

#define USBCORE_UEP11SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP11SET) Register Mask  */


/* -------- USBCORE_UEP11INV : (USBCORE Offset: 0x3BC) (R/W 32)  -------- */
#define USBCORE_UEP11INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP11INV)   Reset Value */

#define USBCORE_UEP11INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP11INV) Register Mask  */


/* -------- USBCORE_U1EP12 : (USBCORE Offset: 0x3C0) (R/W 32) USB Endpoint Control Register 12 -------- */
#define USBCORE_U1EP12_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP12) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP12_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP12_EPHSHK_Pos)         /* (USBCORE_U1EP12) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP12_EPHSHK(value)          (USBCORE_U1EP12_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP12_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP12 register */
#define   USBCORE_U1EP12_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP12) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP12_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP12) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP12_EPHSHK_ON              (USBCORE_U1EP12_EPHSHK_ON_Val << USBCORE_U1EP12_EPHSHK_Pos) /* (USBCORE_U1EP12) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP12_EPHSHK_OFF             (USBCORE_U1EP12_EPHSHK_OFF_Val << USBCORE_U1EP12_EPHSHK_Pos) /* (USBCORE_U1EP12) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP12_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP12) Endpoint Stall Status bit Position */
#define USBCORE_U1EP12_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP12_EPSTALL_Pos)        /* (USBCORE_U1EP12) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP12_EPSTALL(value)         (USBCORE_U1EP12_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP12_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP12 register */
#define   USBCORE_U1EP12_EPSTALL_STALL_Val    _UINT32_(0x1)                                        /* (USBCORE_U1EP12) Endpoint 12 was stalled  */
#define   USBCORE_U1EP12_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP12) Endpoint 12 was not stalled  */
#define USBCORE_U1EP12_EPSTALL_STALL          (USBCORE_U1EP12_EPSTALL_STALL_Val << USBCORE_U1EP12_EPSTALL_Pos) /* (USBCORE_U1EP12) Endpoint 12 was stalled Position  */
#define USBCORE_U1EP12_EPSTALL_NOT_STALL      (USBCORE_U1EP12_EPSTALL_NOT_STALL_Val << USBCORE_U1EP12_EPSTALL_Pos) /* (USBCORE_U1EP12) Endpoint 12 was not stalled Position  */
#define USBCORE_U1EP12_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP12) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP12_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP12_EPTXEN_Pos)         /* (USBCORE_U1EP12) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP12_EPTXEN(value)          (USBCORE_U1EP12_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP12_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP12 register */
#define   USBCORE_U1EP12_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP12) Endpoint 12 transmit is enabled  */
#define   USBCORE_U1EP12_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP12) Endpoint 12 transmit is disabled  */
#define USBCORE_U1EP12_EPTXEN_ON              (USBCORE_U1EP12_EPTXEN_ON_Val << USBCORE_U1EP12_EPTXEN_Pos) /* (USBCORE_U1EP12) Endpoint 12 transmit is enabled Position  */
#define USBCORE_U1EP12_EPTXEN_OFF             (USBCORE_U1EP12_EPTXEN_OFF_Val << USBCORE_U1EP12_EPTXEN_Pos) /* (USBCORE_U1EP12) Endpoint 12 transmit is disabled Position  */
#define USBCORE_U1EP12_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP12) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP12_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP12_EPRXEN_Pos)         /* (USBCORE_U1EP12) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP12_EPRXEN(value)          (USBCORE_U1EP12_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP12_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP12 register */
#define   USBCORE_U1EP12_EPRXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP12) Endpoint 12 receive is enabled  */
#define   USBCORE_U1EP12_EPRXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP12) Endpoint 12 receive is disabled  */
#define USBCORE_U1EP12_EPRXEN_ON              (USBCORE_U1EP12_EPRXEN_ON_Val << USBCORE_U1EP12_EPRXEN_Pos) /* (USBCORE_U1EP12) Endpoint 12 receive is enabled Position  */
#define USBCORE_U1EP12_EPRXEN_OFF             (USBCORE_U1EP12_EPRXEN_OFF_Val << USBCORE_U1EP12_EPRXEN_Pos) /* (USBCORE_U1EP12) Endpoint 12 receive is disabled Position  */
#define USBCORE_U1EP12_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP12) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP12_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP12_EPCONDIS_Pos)       /* (USBCORE_U1EP12) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP12_EPCONDIS(value)        (USBCORE_U1EP12_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP12_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP12 register */
#define   USBCORE_U1EP12_EPCONDIS_DISALBE_12_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP12) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 12 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP12_EPCONDIS_ENABLE_12_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP12) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 12 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP12_EPCONDIS_DISALBE_12    (USBCORE_U1EP12_EPCONDIS_DISALBE_12_Val << USBCORE_U1EP12_EPCONDIS_Pos) /* (USBCORE_U1EP12) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 12 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP12_EPCONDIS_ENABLE_12     (USBCORE_U1EP12_EPCONDIS_ENABLE_12_Val << USBCORE_U1EP12_EPCONDIS_Pos) /* (USBCORE_U1EP12) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 12 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP12_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP12) Register Mask  */


/* -------- USBCORE_UEP12CLR : (USBCORE Offset: 0x3C4) (R/W 32)  -------- */
#define USBCORE_UEP12CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP12CLR)   Reset Value */

