Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
#define USBCORE_UEP14CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP14CLR) Register Mask  */


/* -------- USBCORE_UEP14SET : (USBCORE Offset: 0x3E8) (R/W 32)  -------- */
#define USBCORE_UEP14SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP14SET)   Reset Value */

#define USBCORE_UEP14SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP14SET) Register Mask  */


/* -------- USBCORE_UEP14INV : (USBCORE Offset: 0x3EC) (R/W 32)  -------- */
#define USBCORE_UEP14INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP14INV)   Reset Value */

#define USBCORE_UEP14INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP14INV) Register Mask  */


/* -------- USBCORE_U1EP15 : (USBCORE Offset: 0x3F0) (R/W 32) USB Endpoint Control Register 15 -------- */
#define USBCORE_U1EP15_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP15) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP15_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP15_EPHSHK_Pos)         /* (USBCORE_U1EP15) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP15_EPHSHK(value)          (USBCORE_U1EP15_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP15_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP15 register */
#define   USBCORE_U1EP15_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP15) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP15_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP15) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP15_EPHSHK_ON              (USBCORE_U1EP15_EPHSHK_ON_Val << USBCORE_U1EP15_EPHSHK_Pos) /* (USBCORE_U1EP15) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP15_EPHSHK_OFF             (USBCORE_U1EP15_EPHSHK_OFF_Val << USBCORE_U1EP15_EPHSHK_Pos) /* (USBCORE_U1EP15) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP15_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP15) Endpoint Stall Status bit Position */
#define USBCORE_U1EP15_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP15_EPSTALL_Pos)        /* (USBCORE_U1EP15) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP15_EPSTALL(value)         (USBCORE_U1EP15_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP15_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP15 register */
#define   USBCORE_U1EP15_EPSTALL_STALL_Val    _UINT32_(0x1)                                        /* (USBCORE_U1EP15) Endpoint 15 was stalled  */
#define   USBCORE_U1EP15_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP15) Endpoint 15 was not stalled  */
#define USBCORE_U1EP15_EPSTALL_STALL          (USBCORE_U1EP15_EPSTALL_STALL_Val << USBCORE_U1EP15_EPSTALL_Pos) /* (USBCORE_U1EP15) Endpoint 15 was stalled Position  */
#define USBCORE_U1EP15_EPSTALL_NOT_STALL      (USBCORE_U1EP15_EPSTALL_NOT_STALL_Val << USBCORE_U1EP15_EPSTALL_Pos) /* (USBCORE_U1EP15) Endpoint 15 was not stalled Position  */
#define USBCORE_U1EP15_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP15) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP15_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP15_EPTXEN_Pos)         /* (USBCORE_U1EP15) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP15_EPTXEN(value)          (USBCORE_U1EP15_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP15_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP15 register */
#define   USBCORE_U1EP15_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP15) Endpoint 15 transmit is enabled  */
#define   USBCORE_U1EP15_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP15) Endpoint 15 transmit is disabled  */
#define USBCORE_U1EP15_EPTXEN_ON              (USBCORE_U1EP15_EPTXEN_ON_Val << USBCORE_U1EP15_EPTXEN_Pos) /* (USBCORE_U1EP15) Endpoint 15 transmit is enabled Position  */
#define USBCORE_U1EP15_EPTXEN_OFF             (USBCORE_U1EP15_EPTXEN_OFF_Val << USBCORE_U1EP15_EPTXEN_Pos) /* (USBCORE_U1EP15) Endpoint 15 transmit is disabled Position  */
#define USBCORE_U1EP15_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP15) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP15_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP15_EPRXEN_Pos)         /* (USBCORE_U1EP15) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP15_EPRXEN(value)          (USBCORE_U1EP15_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP15_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP15 register */
#define   USBCORE_U1EP15_EPRXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP15) Endpoint 15 receive is enabled  */
#define   USBCORE_U1EP15_EPRXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP15) Endpoint 15 receive is disabled  */
#define USBCORE_U1EP15_EPRXEN_ON              (USBCORE_U1EP15_EPRXEN_ON_Val << USBCORE_U1EP15_EPRXEN_Pos) /* (USBCORE_U1EP15) Endpoint 15 receive is enabled Position  */
#define USBCORE_U1EP15_EPRXEN_OFF             (USBCORE_U1EP15_EPRXEN_OFF_Val << USBCORE_U1EP15_EPRXEN_Pos) /* (USBCORE_U1EP15) Endpoint 15 receive is disabled Position  */
#define USBCORE_U1EP15_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP15) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP15_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP15_EPCONDIS_Pos)       /* (USBCORE_U1EP15) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP15_EPCONDIS(value)        (USBCORE_U1EP15_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP15_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP15 register */
#define   USBCORE_U1EP15_EPCONDIS_DISABLE_15_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP15) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 15 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP15_EPCONDIS_ENABLE_15_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP15) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 15 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP15_EPCONDIS_DISABLE_15    (USBCORE_U1EP15_EPCONDIS_DISABLE_15_Val << USBCORE_U1EP15_EPCONDIS_Pos) /* (USBCORE_U1EP15) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 15 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP15_EPCONDIS_ENABLE_15     (USBCORE_U1EP15_EPCONDIS_ENABLE_15_Val << USBCORE_U1EP15_EPCONDIS_Pos) /* (USBCORE_U1EP15) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 15 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP15_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP15) Register Mask  */


