Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/usbcore.h
/* -------- USBCORE_UEP15CLR : (USBCORE Offset: 0x3F4) (R/W 32)  -------- */
#define USBCORE_UEP15CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP15CLR)   Reset Value */

#define USBCORE_UEP15CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP15CLR) Register Mask  */


/* -------- USBCORE_UEP15SET : (USBCORE Offset: 0x3F8) (R/W 32)  -------- */
#define USBCORE_UEP15SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP15SET)   Reset Value */

#define USBCORE_UEP15SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP15SET) Register Mask  */


/* -------- USBCORE_UEP15INV : (USBCORE Offset: 0x3FC) (R/W 32)  -------- */
#define USBCORE_UEP15INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP15INV)   Reset Value */

#define USBCORE_UEP15INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP15INV) Register Mask  */


/** \brief USBCORE register offsets definitions */
#define USBCORE_UOTGIR_REG_OFST        _UINT32_(0x40)      /* (USBCORE_UOTGIR) USB OTG Interrupt Status Register Offset */
#define USBCORE_UOTGIRCLR_REG_OFST     _UINT32_(0x44)      /* (USBCORE_UOTGIRCLR)  Offset */
#define USBCORE_UOTGIRSET_REG_OFST     _UINT32_(0x48)      /* (USBCORE_UOTGIRSET)  Offset */
#define USBCORE_UOTGIRINV_REG_OFST     _UINT32_(0x4C)      /* (USBCORE_UOTGIRINV)  Offset */
#define USBCORE_UOTGIE_REG_OFST        _UINT32_(0x50)      /* (USBCORE_UOTGIE) USB OTG Interrupt Enable Register Offset */
#define USBCORE_UOTGIECLR_REG_OFST     _UINT32_(0x54)      /* (USBCORE_UOTGIECLR)  Offset */
#define USBCORE_UOTGIESET_REG_OFST     _UINT32_(0x58)      /* (USBCORE_UOTGIESET)  Offset */
#define USBCORE_UOTGIEINV_REG_OFST     _UINT32_(0x5C)      /* (USBCORE_UOTGIEINV)  Offset */
#define USBCORE_UOTGSTAT_REG_OFST      _UINT32_(0x60)      /* (USBCORE_UOTGSTAT) USB OTG Status Register Offset */
#define USBCORE_UOTGCON_REG_OFST       _UINT32_(0x70)      /* (USBCORE_UOTGCON) USB OTG Control Register Offset */
#define USBCORE_UOTGCONCLR_REG_OFST    _UINT32_(0x74)      /* (USBCORE_UOTGCONCLR)  Offset */
#define USBCORE_UOTGCONSET_REG_OFST    _UINT32_(0x78)      /* (USBCORE_UOTGCONSET)  Offset */
#define USBCORE_UOTGCONINV_REG_OFST    _UINT32_(0x7C)      /* (USBCORE_UOTGCONINV)  Offset */
#define USBCORE_UPWRC_REG_OFST         _UINT32_(0x80)      /* (USBCORE_UPWRC) USB Power Control Register Offset */
#define USBCORE_UPWRCCLR_REG_OFST      _UINT32_(0x84)      /* (USBCORE_UPWRCCLR)  Offset */
#define USBCORE_UPWRCSET_REG_OFST      _UINT32_(0x88)      /* (USBCORE_UPWRCSET)  Offset */
#define USBCORE_UPWRCINV_REG_OFST      _UINT32_(0x8C)      /* (USBCORE_UPWRCINV)  Offset */
#define USBCORE_UIR_REG_OFST           _UINT32_(0x200)     /* (USBCORE_UIR) USB Interrupt Register Offset */
#define USBCORE_UIRCLR_REG_OFST        _UINT32_(0x204)     /* (USBCORE_UIRCLR)  Offset */
#define USBCORE_UIE_REG_OFST           _UINT32_(0x210)     /* (USBCORE_UIE) USB Interrupt Enable Register Offset */
#define USBCORE_UIECLR_REG_OFST        _UINT32_(0x214)     /* (USBCORE_UIECLR)  Offset */
#define USBCORE_UIESET_REG_OFST        _UINT32_(0x218)     /* (USBCORE_UIESET)  Offset */
#define USBCORE_UIEINV_REG_OFST        _UINT32_(0x21C)     /* (USBCORE_UIEINV)  Offset */
#define USBCORE_UEIR_REG_OFST          _UINT32_(0x220)     /* (USBCORE_UEIR) USB Error Interrupt Status Register Offset */
#define USBCORE_UEIRCLR_REG_OFST       _UINT32_(0x224)     /* (USBCORE_UEIRCLR)  Offset */
#define USBCORE_UEIE_REG_OFST          _UINT32_(0x230)     /* (USBCORE_UEIE) USB Error Interrupt Enable Register Offset */
#define USBCORE_UEIECLR_REG_OFST       _UINT32_(0x234)     /* (USBCORE_UEIECLR)  Offset */
#define USBCORE_UEIESET_REG_OFST       _UINT32_(0x238)     /* (USBCORE_UEIESET)  Offset */
#define USBCORE_UEIEINV_REG_OFST       _UINT32_(0x23C)     /* (USBCORE_UEIEINV)  Offset */
#define USBCORE_USTAT_REG_OFST         _UINT32_(0x240)     /* (USBCORE_USTAT) USB Status Register Offset */
#define USBCORE_USTATCLR_REG_OFST      _UINT32_(0x244)     /* (USBCORE_USTATCLR)  Offset */
#define USBCORE_USTATSET_REG_OFST      _UINT32_(0x248)     /* (USBCORE_USTATSET)  Offset */
#define USBCORE_USTATINV_REG_OFST      _UINT32_(0x24C)     /* (USBCORE_USTATINV)  Offset */
#define USBCORE_UCON_REG_OFST          _UINT32_(0x250)     /* (USBCORE_UCON) USB Control Register Offset */
#define USBCORE_UCONCLR_REG_OFST       _UINT32_(0x254)     /* (USBCORE_UCONCLR)  Offset */
#define USBCORE_UCONSET_REG_OFST       _UINT32_(0x258)     /* (USBCORE_UCONSET)  Offset */
#define USBCORE_UCONINV_REG_OFST       _UINT32_(0x25C)     /* (USBCORE_UCONINV)  Offset */
#define USBCORE_UADDR_REG_OFST         _UINT32_(0x260)     /* (USBCORE_UADDR) USB Address Register Offset */
#define USBCORE_UADDRCLR_REG_OFST      _UINT32_(0x264)     /* (USBCORE_UADDRCLR)  Offset */
#define USBCORE_UADDRSET_REG_OFST      _UINT32_(0x268)     /* (USBCORE_UADDRSET)  Offset */
#define USBCORE_UADDRINV_REG_OFST      _UINT32_(0x26C)     /* (USBCORE_UADDRINV)  Offset */
#define USBCORE_UBDTP1_REG_OFST        _UINT32_(0x270)     /* (USBCORE_UBDTP1) USB BDT Page 1 Register Offset */
#define USBCORE_UBDTP1CLR_REG_OFST     _UINT32_(0x274)     /* (USBCORE_UBDTP1CLR)  Offset */
#define USBCORE_UBDTP1SET_REG_OFST     _UINT32_(0x278)     /* (USBCORE_UBDTP1SET)  Offset */
#define USBCORE_UBDTP1INV_REG_OFST     _UINT32_(0x27C)     /* (USBCORE_UBDTP1INV)  Offset */
#define USBCORE_UFRML_REG_OFST         _UINT32_(0x280)     /* (USBCORE_UFRML) USB Frame Number Low Register Offset */
#define USBCORE_UFRMLCLR_REG_OFST      _UINT32_(0x284)     /* (USBCORE_UFRMLCLR)  Offset */
#define USBCORE_UFRMLSET_REG_OFST      _UINT32_(0x288)     /* (USBCORE_UFRMLSET)  Offset */
#define USBCORE_UFRMLINV_REG_OFST      _UINT32_(0x28C)     /* (USBCORE_UFRMLINV)  Offset */
#define USBCORE_UFRMH_REG_OFST         _UINT32_(0x290)     /* (USBCORE_UFRMH) USB Frame Number High Register Offset */
#define USBCORE_UFRMHCLR_REG_OFST      _UINT32_(0x294)     /* (USBCORE_UFRMHCLR)  Offset */
#define USBCORE_UFRMHSET_REG_OFST      _UINT32_(0x298)     /* (USBCORE_UFRMHSET)  Offset */
#define USBCORE_UFRMHINV_REG_OFST      _UINT32_(0x29C)     /* (USBCORE_UFRMHINV)  Offset */
#define USBCORE_UTOK_REG_OFST          _UINT32_(0x2A0)     /* (USBCORE_UTOK) USB Token Register Offset */
#define USBCORE_UTOKCLR_REG_OFST       _UINT32_(0x2A4)     /* (USBCORE_UTOKCLR)  Offset */
#define USBCORE_UTOKSET_REG_OFST       _UINT32_(0x2A8)     /* (USBCORE_UTOKSET)  Offset */
#define USBCORE_UTOKINV_REG_OFST       _UINT32_(0x2AC)     /* (USBCORE_UTOKINV)  Offset */
#define USBCORE_USOF_REG_OFST          _UINT32_(0x2B0)     /* (USBCORE_USOF) USB SOF Threshold Register Offset */
#define USBCORE_USOFCLR_REG_OFST       _UINT32_(0x2B4)     /* (USBCORE_USOFCLR)  Offset */
#define USBCORE_USOFSET_REG_OFST       _UINT32_(0x2B8)     /* (USBCORE_USOFSET)  Offset */
#define USBCORE_USOFINV_REG_OFST       _UINT32_(0x2BC)     /* (USBCORE_USOFINV)  Offset */
#define USBCORE_UBDTP2_REG_OFST        _UINT32_(0x2C0)     /* (USBCORE_UBDTP2) USB BDT PAGE 2 Register Offset */
#define USBCORE_UBDTP2CLR_REG_OFST     _UINT32_(0x2C4)     /* (USBCORE_UBDTP2CLR)  Offset */
#define USBCORE_UBDTP2SET_REG_OFST     _UINT32_(0x2C8)     /* (USBCORE_UBDTP2SET)  Offset */
#define USBCORE_UBDTP2INV_REG_OFST     _UINT32_(0x2CC)     /* (USBCORE_UBDTP2INV)  Offset */
#define USBCORE_UBDTP3_REG_OFST        _UINT32_(0x2D0)     /* (USBCORE_UBDTP3) USB BDT PAGE 3 Register Offset */
#define USBCORE_UBDTP3CLR_REG_OFST     _UINT32_(0x2D4)     /* (USBCORE_UBDTP3CLR)  Offset */
#define USBCORE_UBDTP3SET_REG_OFST     _UINT32_(0x2D8)     /* (USBCORE_UBDTP3SET)  Offset */
#define USBCORE_UBDTP3INV_REG_OFST     _UINT32_(0x2DC)     /* (USBCORE_UBDTP3INV)  Offset */
#define USBCORE_UCNFG1_REG_OFST        _UINT32_(0x2E0)     /* (USBCORE_UCNFG1) USB Configuration 1 Register Offset */
#define USBCORE_UCNFG1CLR_REG_OFST     _UINT32_(0x2E4)     /* (USBCORE_UCNFG1CLR)  Offset */
#define USBCORE_UCNFG1SET_REG_OFST     _UINT32_(0x2E8)     /* (USBCORE_UCNFG1SET)  Offset */
#define USBCORE_UCNFG1INV_REG_OFST     _UINT32_(0x2EC)     /* (USBCORE_UCNFG1INV)  Offset */
#define USBCORE_UEP0_REG_OFST          _UINT32_(0x300)     /* (USBCORE_UEP0) USB Endpoint Control Register 0 Offset */
#define USBCORE_UEP0CLR_REG_OFST       _UINT32_(0x304)     /* (USBCORE_UEP0CLR)  Offset */
#define USBCORE_UEP0SET_REG_OFST       _UINT32_(0x308)     /* (USBCORE_UEP0SET)  Offset */
#define USBCORE_UEP0INV_REG_OFST       _UINT32_(0x30C)     /* (USBCORE_UEP0INV)  Offset */
#define USBCORE_UEP1_REG_OFST          _UINT32_(0x310)     /* (USBCORE_UEP1) USB Endpoint Control Register 1 Offset */
#define USBCORE_UEP1CLR_REG_OFST       _UINT32_(0x314)     /* (USBCORE_UEP1CLR)  Offset */
#define USBCORE_UEP1SET_REG_OFST       _UINT32_(0x318)     /* (USBCORE_UEP1SET)  Offset */
#define USBCORE_UEP1INV_REG_OFST       _UINT32_(0x31C)     /* (USBCORE_UEP1INV)  Offset */
#define USBCORE_UEP2_REG_OFST          _UINT32_(0x320)     /* (USBCORE_UEP2) USB Endpoint Control Register 2 Offset */
#define USBCORE_UEP2CLR_REG_OFST       _UINT32_(0x324)     /* (USBCORE_UEP2CLR)  Offset */
#define USBCORE_UEP2SET_REG_OFST       _UINT32_(0x328)     /* (USBCORE_UEP2SET)  Offset */
#define USBCORE_UEP2INV_REG_OFST       _UINT32_(0x32C)     /* (USBCORE_UEP2INV)  Offset */
#define USBCORE_UEP3_REG_OFST          _UINT32_(0x330)     /* (USBCORE_UEP3) USB Endpoint Control Register 3 Offset */
#define USBCORE_UEP3CLR_REG_OFST       _UINT32_(0x334)     /* (USBCORE_UEP3CLR)  Offset */
#define USBCORE_UEP3SET_REG_OFST       _UINT32_(0x338)     /* (USBCORE_UEP3SET)  Offset */
#define USBCORE_UEP3INV_REG_OFST       _UINT32_(0x33C)     /* (USBCORE_UEP3INV)  Offset */
#define USBCORE_UEP4_REG_OFST          _UINT32_(0x340)     /* (USBCORE_UEP4) USB Endpoint Control Register 4 Offset */
#define USBCORE_UEP4CLR_REG_OFST       _UINT32_(0x344)     /* (USBCORE_UEP4CLR)  Offset */
#define USBCORE_UEP4SET_REG_OFST       _UINT32_(0x348)     /* (USBCORE_UEP4SET)  Offset */
#define USBCORE_UEP4INV_REG_OFST       _UINT32_(0x34C)     /* (USBCORE_UEP4INV)  Offset */
#define USBCORE_UEP5_REG_OFST          _UINT32_(0x350)     /* (USBCORE_UEP5) USB Endpoint Control Register 5 Offset */
#define USBCORE_UEP5CLR_REG_OFST       _UINT32_(0x354)     /* (USBCORE_UEP5CLR)  Offset */
#define USBCORE_UEP5SET_REG_OFST       _UINT32_(0x358)     /* (USBCORE_UEP5SET)  Offset */
#define USBCORE_UEP5INV_REG_OFST       _UINT32_(0x35C)     /* (USBCORE_UEP5INV)  Offset */
#define USBCORE_UEP6_REG_OFST          _UINT32_(0x360)     /* (USBCORE_UEP6) USB Endpoint Control Register 6 Offset */
#define USBCORE_UEP6CLR_REG_OFST       _UINT32_(0x364)     /* (USBCORE_UEP6CLR)  Offset */
#define USBCORE_UEP6SET_REG_OFST       _UINT32_(0x368)     /* (USBCORE_UEP6SET)  Offset */
#define USBCORE_UEP6INV_REG_OFST       _UINT32_(0x36C)     /* (USBCORE_UEP6INV)  Offset */
#define USBCORE_UEP7_REG_OFST          _UINT32_(0x370)     /* (USBCORE_UEP7) USB Endpoint Control Register 7 Offset */
#define USBCORE_UEP7CLR_REG_OFST       _UINT32_(0x374)     /* (USBCORE_UEP7CLR)  Offset */
#define USBCORE_UEP7SET_REG_OFST       _UINT32_(0x378)     /* (USBCORE_UEP7SET)  Offset */
#define USBCORE_UEP7INV_REG_OFST       _UINT32_(0x37C)     /* (USBCORE_UEP7INV)  Offset */
#define USBCORE_U1EP8_REG_OFST         _UINT32_(0x380)     /* (USBCORE_U1EP8) USB Endpoint Control Register 8 Offset */
#define USBCORE_UEP8CLR_REG_OFST       _UINT32_(0x384)     /* (USBCORE_UEP8CLR)  Offset */
#define USBCORE_UEP8SET_REG_OFST       _UINT32_(0x388)     /* (USBCORE_UEP8SET)  Offset */
#define USBCORE_UEP8INV_REG_OFST       _UINT32_(0x38C)     /* (USBCORE_UEP8INV)  Offset */
#define USBCORE_U1EP9_REG_OFST         _UINT32_(0x390)     /* (USBCORE_U1EP9) USB Endpoint Control Register 9 Offset */
#define USBCORE_UEP9CLR_REG_OFST       _UINT32_(0x394)     /* (USBCORE_UEP9CLR)  Offset */
#define USBCORE_UEP9SET_REG_OFST       _UINT32_(0x398)     /* (USBCORE_UEP9SET)  Offset */
#define USBCORE_UEP9INV_REG_OFST       _UINT32_(0x39C)     /* (USBCORE_UEP9INV)  Offset */
#define USBCORE_U1EP10_REG_OFST        _UINT32_(0x3A0)     /* (USBCORE_U1EP10) USB Endpoint Control Register 10 Offset */
#define USBCORE_UEP10CLR_REG_OFST      _UINT32_(0x3A4)     /* (USBCORE_UEP10CLR)  Offset */
#define USBCORE_UEP10SET_REG_OFST      _UINT32_(0x3A8)     /* (USBCORE_UEP10SET)  Offset */
#define USBCORE_UEP10INV_REG_OFST      _UINT32_(0x3AC)     /* (USBCORE_UEP10INV)  Offset */
#define USBCORE_U1EP11_REG_OFST        _UINT32_(0x3B0)     /* (USBCORE_U1EP11) USB Endpoint Control Register 11 Offset */
#define USBCORE_UEP11CLR_REG_OFST      _UINT32_(0x3B4)     /* (USBCORE_UEP11CLR)  Offset */
#define USBCORE_UEP11SET_REG_OFST      _UINT32_(0x3B8)     /* (USBCORE_UEP11SET)  Offset */
#define USBCORE_UEP11INV_REG_OFST      _UINT32_(0x3BC)     /* (USBCORE_UEP11INV)  Offset */
#define USBCORE_U1EP12_REG_OFST        _UINT32_(0x3C0)     /* (USBCORE_U1EP12) USB Endpoint Control Register 12 Offset */
#define USBCORE_UEP12CLR_REG_OFST      _UINT32_(0x3C4)     /* (USBCORE_UEP12CLR)  Offset */
#define USBCORE_UEP12SET_REG_OFST      _UINT32_(0x3C8)     /* (USBCORE_UEP12SET)  Offset */
#define USBCORE_UEP12INV_REG_OFST      _UINT32_(0x3CC)     /* (USBCORE_UEP12INV)  Offset */
#define USBCORE_U1EP13_REG_OFST        _UINT32_(0x3D0)     /* (USBCORE_U1EP13) USB Endpoint Control Register 13 Offset */
#define USBCORE_UEP13CLR_REG_OFST      _UINT32_(0x3D4)     /* (USBCORE_UEP13CLR)  Offset */
#define USBCORE_UEP13SET_REG_OFST      _UINT32_(0x3D8)     /* (USBCORE_UEP13SET)  Offset */
#define USBCORE_UEP13INV_REG_OFST      _UINT32_(0x3DC)     /* (USBCORE_UEP13INV)  Offset */
#define USBCORE_U1EP14_REG_OFST        _UINT32_(0x3E0)     /* (USBCORE_U1EP14) USB Endpoint Control Register 14 Offset */
#define USBCORE_UEP14CLR_REG_OFST      _UINT32_(0x3E4)     /* (USBCORE_UEP14CLR)  Offset */
#define USBCORE_UEP14SET_REG_OFST      _UINT32_(0x3E8)     /* (USBCORE_UEP14SET)  Offset */
#define USBCORE_UEP14INV_REG_OFST      _UINT32_(0x3EC)     /* (USBCORE_UEP14INV)  Offset */
#define USBCORE_U1EP15_REG_OFST        _UINT32_(0x3F0)     /* (USBCORE_U1EP15) USB Endpoint Control Register 15 Offset */
#define USBCORE_UEP15CLR_REG_OFST      _UINT32_(0x3F4)     /* (USBCORE_UEP15CLR)  Offset */
#define USBCORE_UEP15SET_REG_OFST      _UINT32_(0x3F8)     /* (USBCORE_UEP15SET)  Offset */
#define USBCORE_UEP15INV_REG_OFST      _UINT32_(0x3FC)     /* (USBCORE_UEP15INV)  Offset */

